<!--
// Translated by 	  	: Vitor Gonçalves
// Date of translation		: 2006/10/01
-->
<img alt="Sum&aacute;rio" valign="middle" src="<?php echo $CFG->wwwroot?>/mod/lessonsummary/icon.gif">&nbsp;<b>Sum&aacute;rios das Aulas </b>

<div class="indent">
  <p>O M&oacute;dulo de Sum&aacute;rios das Aulas, tal como o pr&oacute;prio nome indica, permite registar um sum&aacute;rio por cada aula presencial ou &agrave; dist&acirc;ncia. Este m&oacute;dulo permite ainda a integra&ccedil;&atilde;o com os m&oacute;dulos de metadados LOM e DCMES para a anota&ccedil;&atilde;o semi-autom&aacute;tica dos sum&aacute;rios, favorecendo assim a pesquisa deste objecto de aprendizagem atrav&eacute;s do bloco Procurar LOs atrav&eacute;s dos seus metadados. </p>
  <ul>
    <li> O <strong>n.&ordm; da aula</strong> &eacute; sequencial. No entanto, o professor pode alterar o valor escolhendo na caixa de combina&ccedil;&atilde;o o n&uacute;mero correspondente &agrave; aula que pretende sumariar. No caso extremo de uma disciplina ultrapassar as 300 aulas, o professor pode adicionar um novo n.&ordm; de aula escolhendo &quot;0 (zero)&quot; para o n.&ordm; aula   + bot&atilde;o &quot;&gt;&quot;. Assim, poder&aacute; transformar a caixa de combina&ccedil;&atilde;o em caixa de texto para acrescentar n&uacute;meros personalizados.</li>
    <li> Na caixa <strong>tipo de aula</strong>, o professor pode escolher de entre as op&ccedil;&otilde;es &quot;Te&oacute;rica; Te&oacute;rico-Pr&aacute;tica; Pr&aacute;tica Laboratorial; Trabalho de Campo; Semin&aacute;rio; Est&aacute;gio; Orienta&ccedil;&atilde;o Tut&oacute;ria; Outra. No caso de escolher a &uacute;ltima op&ccedil;&atilde;o, esta pode ser complementada usando a op&ccedil;&atilde;o &quot;Inserir novo valor&quot; + bot&atilde;o &quot;&gt;&quot;. Assim, poder&aacute; transformar a caixa de combina&ccedil;&atilde;o em caixa de texto para inserir um tipo de aula personalizado.</li>
    <li>A <strong>data e hora de in&iacute;cio</strong> e <strong>data e hora de conclus&atilde;o</strong> referem-se &agrave; dura&ccedil;&atilde;o da aula a sumariar. A diferen&ccedil;a entre as duas datas/horas corresponder&aacute; ao tempo lectivo a exibir no campo seguinte. Note que, caso a data e hora de conclus&atilde;o seja inferior ou igual &agrave; data e hora de in&iacute;cio, ser&aacute; redireccionado novamente para a p&aacute;gina de actualiza&ccedil;&atilde;o do sum&aacute;rio.</li>
    <li> O <strong>tempo lectivo</strong> corresponder&aacute; automaticamente &agrave; diferen&ccedil;a entre a data e hora de conclus&atilde;o da aula e &agrave; data e hora de in&iacute;cio da aula.</li>
    <li>Para mencionar o <strong>n&uacute;mero de presen&ccedil;as</strong> bastar&aacute; escolher o n&uacute;mero correspondente &agrave; assiduidade na caixa de combina&ccedil;&atilde;o. Em situa&ccedil;&otilde;es extremas, tal como no caso do n.&ordm; da aula, o professor  poder&aacute; definir um valor acima de 300 escolhendo &quot;-1&quot; + bot&atilde;o &quot;&gt;&quot;. Assim, poder&aacute; transformar a caixa de combina&ccedil;&atilde;o em caixa de texto para inserir um n.&ordm; de presen&ccedil;as personalizado.</li>
    <li>O campo do<strong> sum&aacute;rio</strong> permite sumariar a aula referida nos campos anterior. O sum&aacute;rio pode ser complementado com a bibliografia ou outras informa&ccedil;&otilde;es atrav&eacute;s do campo <strong>bibliografia e outras informa&ccedil;&otilde;es</strong>.</li>
    <li>Caso os m&oacute;dulos de metadados estejam instalados no sistema de e-Learning Moodle, o sum&aacute;rio pode ser anotado atrav&eacute;s de Metadados LOM e/ou Metadados DCMES de forma semi-autom&aacute;tica. Para tal, o docente dever&aacute; gravar o formul&aacute;rio com a op&ccedil;&atilde;o Sim em &quot;<strong>Adicionar metadados</strong>&quot;. Esta op&ccedil;&atilde;o permitir-lhe-&aacute; despoletar a adi&ccedil;&atilde;o semi-autom&aacute;tica de metadados a partir da vista de visualiza&ccedil;&atilde;o do sum&aacute;rio. <br />
    </li>
  </ul>
</div>

