<!--
// Translated by 	  	: Vitor Gonçalves
// Date of translation		: 2006/10/01
-->
<img alt="Sum&aacute;rio" valign="middle" src="<?php echo $CFG->wwwroot?>/mod/lessonsummary/icon.gif">&nbsp;<b>Programas da Unidade Curricular ou Disciplina </b>

<div class="indent">
  <p>O M&oacute;dulo de Programas da Disciplina, tal como o pr&oacute;prio nome indica, permite publicar o programa ou plano geral da disciplina. O m&oacute;dulo poder&aacute; ser utilizado para publicar planos anuais, semestrais, trimetrais, mensais ou mesmo de aula a aula. Este m&oacute;dulo permite ainda a integra&ccedil;&atilde;o com os m&oacute;dulos de metadados LOM e DCMES para a anota&ccedil;&atilde;o semi-autom&aacute;tica dos programas, favorecendo assim a pesquisa deste objecto de aprendizagem atrav&eacute;s do bloco Procurar LOs atrav&eacute;s dos seus metadados. </p>
  <ul>
    <li> O cabe&ccedil;alho do programa agrupa a categoria e nome do curso, a designa&ccedil;&atilde;o da disciplina ou curso de forma&ccedil;&atilde;o e respectivo regime (anual ou semestral), o n&uacute;mero de horas e de cr&eacute;ditos (ECTS) e o nome do(s) docente(s), para al&eacute;m da data de in&iacute;cio e data de conclus&atilde;o da disciplina. A grande maioria destes dados derivam do formul&aacute;rio de configura&ccedil;&atilde;o da disciplina.</li>
    <li> Na caixa de combina&ccedil;&atilde;o <strong>regime</strong>, o professor pode escolher op&ccedil;&otilde;es inerentes ao tipo de disciplina (anual, semestral, trimestral, mensal ou outro). No caso de escolher a &uacute;ltima op&ccedil;&atilde;o, esta pode ser complementada usando a op&ccedil;&atilde;o &quot;Inserir novo valor&quot; + bot&atilde;o &quot;&gt;&quot;. Assim, poder&aacute; transformar a caixa de combina&ccedil;&atilde;o em caixa de texto para inserir um tipo de aula personalizado.</li>
    <li>A <strong>data e hora de in&iacute;cio</strong> e <strong>data e hora de conclus&atilde;o</strong> referem-se &agrave; primeira sess&atilde;o ou aula e &agrave; &uacute;ltima sess&atilde;o ou aula, respectivamente. No entanto, tamb&eacute;m podem ser usadas para expressar o in&iacute;cio do ano lectivo e o seu terminus. Note que, caso a data e hora de conclus&atilde;o seja inferior ou igual &agrave; data e hora de in&iacute;cio, ser&aacute; redireccionado novamente para a p&aacute;gina de actualiza&ccedil;&atilde;o do programa da disciplina.</li>
    <li>Ao <strong>n&uacute;mero de horas </strong> (Tempo de trabalho) &eacute; automaticamente atribu&iacute;do o n.&ordm; de sec&ccedil;&otilde;es da p&aacute;gina principal (assumindo 1 sess&atilde;o por t&oacute;pico ou por semana). Por conseguinte, dever&aacute; conferir este valor.</li>
    <li>O corpo do programa da disciplina &eacute; constitu&iacute;do essencialmente pelos seguintes campos: <strong>Introdu&ccedil;&atilde;o</strong> (corresponde ao sum&aacute;rio ou resumo das configura&ccedil;&otilde;es da disciplina); <strong>Objectivos</strong> (permite enumerar os objectivos ou compet&ecirc;ncias de aprendizagem); <strong>Prioridades</strong>; <strong>Pr&eacute;-requisitos</strong>; <strong>Unidades did&aacute;cticas, temas e conte&uacute;dos de aprendizagem</strong>; <strong>Metodologia de aprendizagem</strong>;  <strong>Avalia&ccedil;&atilde;o</strong> (permite explicitar os m&eacute;todos de avalia&ccedil;&atilde;o a aplicar), <strong>Bibliografia </strong>e <strong>outras informa&ccedil;&otilde;es</strong>. </li>
    <li>Caso os m&oacute;dulos de metadados estejam instalados no sistema de e-Learning Moodle, o programa pode ser anotado atrav&eacute;s de Metadados LOM e/ou Metadados DCMES de forma semi-autom&aacute;tica. Para tal, o docente dever&aacute; gravar o formul&aacute;rio com a op&ccedil;&atilde;o Sim em &quot;<strong>Adicionar metadados</strong>&quot;. Esta op&ccedil;&atilde;o permitir-lhe-&aacute; despoletar a adi&ccedil;&atilde;o semi-autom&aacute;tica de metadados a partir da vista de visualiza&ccedil;&atilde;o do programa. <br />
    </li>
  </ul>
</div>

