<?PHP

$string['pluginname'] = 'Очистить деятельность';
$string['title'] = 'Пакетная очистка деятельности';
$string['confirmation'] = 'Вы уверены, что хотите очистить деятельность всех этих пользователей и отчислить их с выбранных курсов? Этот процесс может занять много времени.';
$string['outof'] = 'из';
$string['processed'] ='пользователей обработано...';
$string['continue'] = 'Предыдущий процесс очистки был прерван. Продолжить?';
$string['allcourses'] = 'Все курсы';
$string['selectedcourses'] = 'Выбранные курсы';
$string['accept'] = 'Принять';
$string['removeall'] = 'Удалить все из выбранных';

?>
